In [1]:
import pandas as pd 
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [2]:
df = pd.read_excel('/Users/shaikmohammadasrarahammad/Downloads/Crescent subjects/sem 6/EDA/prods.xlsx')

In [3]:
df

,Products produced (in million),Profits gained(in million),MAR,MCAR,MNAR
0,52,15,NaN,NaN,NaN
1,55,4,NaN,4.0,4.0
2,56,11,NaN,11.0,NaN
3,56,11,NaN,11.0,NaN
4,63,6,NaN,6.0,6.0
5,64,11,NaN,11.0,NaN
6,64,7,NaN,NaN,7.0
7,65,10,NaN,10.0,NaN
8,70,10,NaN,10.0,10.0
9,70,8,8.0,8.0,NaN
10,73,8,8.0,NaN,8.0
11,74,3,3.0,3.0,3.0
12,75,12,12.0,12.0,NaN
13,79,6,6.0,6.0,6.0
14,80,7,7.0,7.0,7.0
15,82,12,12.0,12.0,NaN
16,94,9,9.0,9.0,9.0
17,98,7,7.0,7.0,NaN
18,99,13,13.0,NaN,13.0
19,101,15,15.0,15.0,15.0
20,102,14,14.0,14.0,14.0
21,104,13,13.0,13.0,13.0
22,105,15,15.0,15.0,15.0
23,105,3,3.0,3.0,3.0
24,111,7,7.0,7.0,7.0
25,113,13,13.0,13.0,13.0
26,115,8,8.0,8.0,8.0
27,116,5,5.0,5.0,5.0
28,119,14,14.0,14.0,14.0
29,120,10,10.0,NaN,10.0
30,120,10,10.0,10.0,10.0
31,125,1,1.0,1.0,1.0
32,128,7,7.0,7.0,7.0
33,134,1,1.0,1.0,1.0
34,141,12,12.0,12.0,12.0
35,141,11,11.0,NaN,11.0
36,143,12,12.0,12.0,12.0
37,151,7,7.0,7.0,7.0
38,161,4,4.0,NaN,4.0
39,166,9,9.0,9.0,9.0
40,166,15,15.0,15.0,15.0
41,171,8,8.0,8.0,8.0
42,172,12,12.0,12.0,12.0
43,175,4,4.0,NaN,4.0
44,175,11,11.0,11.0,11.0
45,177,11,11.0,11.0,11.0
46,180,2,2.0,2.0,2.0
47,185,12,12.0,NaN,12.0
48,188,7,7.0,7.0,7.0
49,194,15,15.0,15.0,15.0

In [4]:
df_describe = df['Profits gained(in million)'].describe()
df_describe

count    50.000000
mean      9.160000
std       3.908964
min       1.000000
25%       7.000000
50%      10.000000
75%      12.000000
max      15.000000
Name: Profits gained(in million), dtype: float64

In [5]:
df.isnull().sum()

Products produced (in million)    0
Profits gained(in million)        0
MAR                               9
MCAR                              9
MNAR                              9
dtype: int64

# Missing at Random

In [6]:
mar_df = df[['Products produced (in million)','MAR']]
mar_df.head()

   Products produced (in million)  MAR
0                              52  NaN
1                              55  NaN
2                              56  NaN
3                              56  NaN
4                              63  NaN

In [7]:
mar_df.isnull().sum()

Products produced (in million)    0
MAR                               9
dtype: int64

# Removing null values

In [8]:
rm_null_mar = mar_df.dropna()
rm_null_mar.isnull().sum()
rm_null_mar.rename(columns={'MAR': 'dropna'},inplace=True)
rm_null_mar.head()

/var/folders/kh/nby254ps3kv79sh2q9w5ndh80000gn/T/ipykernel_94013/3223884158.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  rm_null_mar.rename(columns={'MAR': 'dropna'},inplace=True)

    Products produced (in million)  dropna
9                               70     8.0
10                              73     8.0
11                              74     3.0
12                              75    12.0
13                              79     6.0

In [9]:
mar_na_det = rm_null_mar.describe()

# Replacing with arthematic mean

In [10]:
avg_mar_df = mar_df.fillna(mar_df['MAR'].mean())
avg_mar_df.rename(columns={'MAR': 'Average'},inplace=True)

In [11]:
mar_avg_det = avg_mar_df.describe()

# Regression Imputation

In [12]:
null = mar_df['MAR'].isnull()
null_df = pd.DataFrame(mar_df['Products produced (in million)'][null])

In [13]:
null_df.shape

(9, 1)

In [14]:
ri_df = mar_df.dropna()
ri_df.shape

(41, 2)

In [15]:
X = ri_df[['Products produced (in million)']]
y = ri_df['MAR']

In [16]:
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size=0.2, random_state=42)

In [17]:
reg = LinearRegression()
reg.fit(X_train, y_train)

LinearRegression()

In [18]:
y_pred = reg.predict(null_df)

In [19]:
y_pred

array([9.07304317, 9.07517019, 9.07587919, 9.07587919, 9.08084223,
       9.08155124, 9.08155124, 9.08226025, 9.08580527])

In [20]:
null_df['MAR'] = y_pred

In [21]:
null_df

   Products produced (in million)       MAR
0                              52  9.073043
1                              55  9.075170
2                              56  9.075879
3                              56  9.075879
4                              63  9.080842
5                              64  9.081551
6                              64  9.081551
7                              65  9.082260
8                              70  9.085805

In [22]:
ri_df = pd.concat([ri_df,null_df])
ri_df.rename(columns={'MAR': 'RI'},inplace=True)
print(ri_df.isnull().sum())
print()
print(ri_df.shape)

Products produced (in million)    0
RI                                0
dtype: int64

(50, 2)

In [23]:
ri_mar_det = ri_df.describe()

# Stocastic Regression Imputation

In [24]:
sri_df = mar_df.dropna()
sri_df.shape

(41, 2)

In [25]:
null = mar_df['MAR'].isnull()
null_df = pd.DataFrame(mar_df['Products produced (in million)'][null])

In [26]:
y_pred_noise = reg.predict(null_df) + np.random.randn(9,)

In [27]:
y_pred_noise

array([ 9.54506754,  8.14443638,  9.69563666,  9.3634731 ,  8.46544551,
       10.31596336,  8.96762423,  9.34097895,  9.58558115])

In [28]:
null_df['MAR'] = y_pred_noise
null_df

   Products produced (in million)        MAR
0                              52   9.545068
1                              55   8.144436
2                              56   9.695637
3                              56   9.363473
4                              63   8.465446
5                              64  10.315963
6                              64   8.967624
7                              65   9.340979
8                              70   9.585581

In [29]:
sri_df = pd.concat([sri_df, null_df])
sri_df.rename(columns={'MAR': 'SRI'},inplace=True)
sri_df.shape

(50, 2)

In [30]:
sri_mar_det = sri_df.describe()

# Conclusion Report of MAR

In [31]:
mar_final = pd.concat([mar_na_det, mar_avg_det['Average'] ,ri_mar_det['RI'] ,sri_mar_det['SRI'],df_describe,],axis=1)
mar_final

,Products produced (in million),dropna,Average,RI,SRI,Profits gained(in million)
count,41.000000,41.000000,50.000000,50.000000,50.000000,50.000000
mean,127.512195,9.097561,9.097561,9.094240,9.128484,9.160000
std,37.257296,4.066970,3.674539,3.674547,3.684766,3.908964
min,70.000000,1.000000,1.000000,1.000000,1.000000,1.000000
25%,101.000000,7.000000,7.000000,7.000000,7.000000,7.000000
50%,120.000000,9.000000,9.097561,9.078361,9.352226,10.000000
75%,166.000000,12.000000,12.000000,12.000000,12.000000,12.000000
max,194.000000,15.000000,15.000000,15.000000,15.000000,15.000000

# Missing Completely at Random

In [32]:
mcar_df = df[['Products produced (in million)','MCAR']]
mcar_df.head()

   Products produced (in million)  MCAR
0                              52   NaN
1                              55   4.0
2                              56  11.0
3                              56  11.0
4                              63   6.0

In [33]:
mcar_df.isnull().sum()

Products produced (in million)    0
MCAR                              9
dtype: int64

# Removing Null values

In [34]:
mcar_na_df = mcar_df.dropna()

In [35]:
mcar_na_df.shape
mcar_na_df.rename(columns={'MCAR':'dropna'},inplace=True)

/var/folders/kh/nby254ps3kv79sh2q9w5ndh80000gn/T/ipykernel_94013/648246599.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  mcar_na_df.rename(columns={'MCAR':'dropna'},inplace=True)

In [36]:
mcar_na_det = mcar_na_df.describe()

# Imputing with arthematic mean

In [37]:
mcar_avg_df = mcar_df.fillna(mcar_df['MCAR'].mean())
mcar_avg_df.rename(columns={'MCAR':'Average'},inplace=True)
mcar_avg_df.head()

   Products produced (in million)    Average
0                              52   9.121951
1                              55   4.000000
2                              56  11.000000
3                              56  11.000000
4                              63   6.000000

In [38]:
mcar_avg_det = mcar_avg_df.describe()

# Regression inputation

In [39]:
null = mcar_df['MCAR'].isnull()
null_df = pd.DataFrame(mcar_df['Products produced (in million)'][null])

In [40]:
ri_df = mcar_df.dropna()
ri_df.shape

(41, 2)

In [41]:
X = ri_df[['Products produced (in million)']]
y = ri_df['MCAR']

In [42]:
X_train,X_test,y_train,y_test = train_test_split(X,y, test_size=0.2, random_state=42)

In [43]:
reg.fit(X_train,y_train)

LinearRegression()

In [44]:
null_df

    Products produced (in million)
0                               52
6                               64
10                              73
18                              99
29                             120
35                             141
38                             161
43                             175
47                             185

In [45]:
y_pred = reg.predict(null_df)

In [46]:
null_df['MCAR'] = y_pred

In [47]:
null_df

    Products produced (in million)      MCAR
0                               52  9.209351
6                               64  9.180283
10                              73  9.158483
18                              99  9.095504
29                             120  9.044636
35                             141  8.993768
38                             161  8.945322
43                             175  8.911410
47                             185  8.887188

In [48]:
ri_df = pd.concat([ri_df,null_df])
ri_df.shape
ri_df.rename(columns={'MCAR':'RI'},inplace=True)

In [49]:
ri_df.head()

   Products produced (in million)    RI
1                              55   4.0
2                              56  11.0
3                              56  11.0
4                              63   6.0
5                              64  11.0

In [50]:
mcar_ri_det = ri_df.describe()

# Stocastic Regression imputation

In [51]:
y_pred_noise = y_pred + np.random.randn()

In [52]:
sri_df = df[['Products produced (in million)','MCAR']]

In [53]:
sri_df.isnull().sum()

Products produced (in million)    0
MCAR                              9
dtype: int64

In [54]:
null = sri_df['MCAR'].isnull()
null_df = pd.DataFrame(sri_df['Products produced (in million)'][null])

In [55]:
sri_df = sri_df.dropna()

In [56]:
sri_df.shape

(41, 2)

In [57]:
null_df['MCAR'] = y_pred_noise

In [58]:
sri_df = pd.concat([sri_df,null_df])

In [59]:
sri_df.rename(columns={'MCAR':'SRI'},inplace=True)

In [60]:
sri_df.head()

   Products produced (in million)   SRI
1                              55   4.0
2                              56  11.0
3                              56  11.0
4                              63   6.0
5                              64  11.0

In [61]:
mcar_sri_det = sri_df.describe()
mcar_sri_det

       Products produced (in million)        SRI
count                       50.000000  50.000000
mean                       115.460000   9.351037
std                         42.593096   3.615330
min                         52.000000   1.000000
25%                         76.000000   7.000000
50%                        112.000000  10.275689
75%                        149.000000  11.750000
max                        194.000000  15.000000

In [62]:
df_det = df.describe()

# Conclusion Report of MCAR

In [63]:

mcar_final = pd.concat([mcar_na_det, mcar_avg_det['Average'] ,mcar_ri_det['RI'] ,mcar_sri_det['SRI'],df_describe,],axis=1)
mcar_final

,Products produced (in million),dropna,Average,RI,SRI,Profits gained(in million)
count,41.000000,41.000000,50.000000,50.000000,50.000000,50.000000
mean,114.707317,9.121951,9.121951,9.108519,9.351037,9.160000
std,41.531460,3.963553,3.581102,3.581550,3.615330,3.908964
min,55.000000,1.000000,1.000000,1.000000,1.000000,1.000000
25%,79.000000,7.000000,7.000000,7.000000,7.000000,7.000000
50%,111.000000,10.000000,9.121951,9.070070,10.275689,10.000000
75%,143.000000,12.000000,11.750000,11.750000,11.750000,12.000000
max,194.000000,15.000000,15.000000,15.000000,15.000000,15.000000

# Missing not at Random

In [64]:
mnar_df = df[['Products produced (in million)','MNAR']]

In [65]:
mnar_df.head()

   Products produced (in million)  MNAR
0                              52   NaN
1                              55   4.0
2                              56   NaN
3                              56   NaN
4                              63   6.0

In [66]:
mnar_df.isnull().sum()

Products produced (in million)    0
MNAR                              9
dtype: int64

# Deleting null values

In [67]:
mnar_na_df = mnar_df.dropna()
mnar_na_df.rename(columns={'MNAR':'dropna'},inplace=True)

/var/folders/kh/nby254ps3kv79sh2q9w5ndh80000gn/T/ipykernel_94013/2828077711.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  mnar_na_df.rename(columns={'MNAR':'dropna'},inplace=True)

In [68]:
mnar_na_df.isnull().sum()

Products produced (in million)    0
dropna                            0
dtype: int64

In [69]:
mnar_na_det = mnar_na_df.describe()

# Imputing with arthematic mean

In [70]:
mnar_avg_df = mnar_df.fillna(mnar_df['MNAR'].mean())
mnar_avg_df.isnull().sum()
mnar_avg_df.rename(columns={'MNAR':'Average'},inplace=True)

In [71]:
mnar_avg_df.shape

(50, 2)

In [72]:
mnar_avg_det = mnar_avg_df.describe()

# Imputation using Regression

In [73]:
null = mnar_df['MNAR'].isnull()
null_df = pd.DataFrame(mnar_df['Products produced (in million)'][null])

In [74]:
null_df

    Products produced (in million)
0                               52
2                               56
3                               56
5                               64
7                               65
9                               70
12                              75
15                              82
17                              98

In [75]:
ri_df = mnar_df.dropna()

In [76]:
ri_df.head()

    Products produced (in million)  MNAR
1                               55   4.0
4                               63   6.0
6                               64   7.0
8                               70  10.0
10                              73   8.0

In [77]:
X = ri_df[['Products produced (in million)']]
y = ri_df['MNAR']

In [78]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=42)

In [79]:
reg.fit(X_train,y_train)
y_pred = reg.predict(null_df)
null_df['MNAR'] = y_pred

In [80]:
ri_df = pd.concat([ri_df,null_df])
ri_df.shape

(50, 2)

In [81]:
ri_df.rename(columns={'MNAR':'RI'},inplace=True)
ri_df.head()

    Products produced (in million)    RI
1                               55   4.0
4                               63   6.0
6                               64   7.0
8                               70  10.0
10                              73   8.0

In [82]:
mnar_ri_det = ri_df.describe()

# Imputation using Stocastic regression

In [83]:
y_pred_noise = y_pred + np.random.randn()

In [84]:
null = mnar_df['MNAR'].isnull()
null_df = pd.DataFrame(mnar_df['Products produced (in million)'][null])

In [85]:
null_df['MNAR'] = y_pred_noise

In [86]:
null_df

    Products produced (in million)      MNAR
0                               52  7.555602
2                               56  7.631607
3                               56  7.631607
5                               64  7.783618
7                               65  7.802620
9                               70  7.897626
12                              75  7.992633
15                              82  8.125643
17                              98  8.429665

In [87]:
sri_df = mnar_df.dropna()
sri_df = pd.concat([sri_df,null_df])
sri_df.shape
sri_df.rename(columns={'MNAR':'SRI'},inplace=True)

In [88]:
mnar_sri_det = sri_df.describe()

In [89]:
df_det = df.describe()

# Conclusion Report of MNAR

In [90]:
final_report = pd.concat([df_det[['Products produced (in million)','Profits gained(in million)']],mnar_na_det['dropna'],mnar_avg_det['Average'],mnar_ri_det['RI'],mnar_sri_det['SRI'],],axis=1)
final_report

,Products produced (in million),Profits gained(in million),dropna,Average,RI,SRI
count,50.000000,50.000000,41.000000,50.000000,50.000000,50.000000
mean,115.460000,9.160000,8.804878,8.804878,8.585598,8.637012
std,42.593096,3.908964,4.112296,3.715492,3.747136,3.734769
min,52.000000,1.000000,1.000000,1.000000,1.000000,1.000000
25%,76.000000,7.000000,6.000000,7.000000,7.000000,7.000000
50%,112.000000,10.000000,9.000000,8.804878,7.920003,8.000000
75%,149.000000,12.000000,12.000000,11.750000,11.750000,11.750000
max,194.000000,15.000000,15.000000,15.000000,15.000000,15.000000